import React, { Component } from 'react';
import logo from '../logo.svg';
import Result from '../components/result_random'
import Detail from '../components/detail'
import Dialog from '../components/dialog'
import Banner from '../dist/img/banner.png'
import Random from '../dist/img/random.png'
import Toggle from '../components/toggle'
import Footer from '../components/footer'
import '../dist/css/shake.css'

const spaceDiv = {
  paddingTop: '20px'
}

const styRandom = {
  width: '70%',  
  maxWidth: '350px',
  paddingTop: '30px'
  
  
}
const styBanner = {
  width: '80%',
  maxWidth: '550px'
}
class App extends Component {
  constructor(props){
    super(props);

    this.state = {
      menu: [
      ['ข้าวไก่ทอดเกลือ', 'ปริมาณแคลอรี่: ข้อมูลยังไม่มี kcal', 'ความเผ็ด: ข้อมูลยังไม่มี', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหมูทอดเกลือ', 'ปริมาณแคลอรี่: ข้อมูลยังไม่มี kcal', 'ความเผ็ด: ข้อมูลยังไม่มี', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดผงกะหรี่กุ้ง', 'ปริมาณแคลอรี่: ข้อมูลยังไม่มี kcal', 'ความเผ็ด: ข้อมูลยังไม่มี', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดผงกะหรี่ทะเล', 'ปริมาณแคลอรี่: ข้อมูลยังไม่มี kcal', 'ความเผ็ด: ข้อมูลยังไม่มี', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดผงกะหรี่ไก่', 'ปริมาณแคลอรี่: ข้อมูลยังไม่มี kcal', 'ความเผ็ด: ข้อมูลยังไม่มี', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวไก่ทอดกระเทียม', 'ปริมาณแคลอรี่: ข้อมูลยังไม่มี kcal', 'ความเผ็ด: ข้อมูลยังไม่มี', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวกะเพราเนื้อ', 'ปริมาณแคลอรี่: 622 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวกุ้งทอดกระเทียม', 'ปริมาณแคลอรี่: 495 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวแกงกะหรี่ไก่', 'ปริมาณแคลอรี่: 389 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวแกงเผ็ดไก่', 'ปริมาณแคลอรี่: 485 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวไก่อบ', 'ปริมาณแคลอรี่: 490 kcal', 'ความเผ็ด: น้อย', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวขาหมู', 'ปริมาณแคลอรี่: 690 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวไข่เจียว', 'ปริมาณแคลอรี่: 445 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวคลุกกะปิ', 'ปริมาณแคลอรี่: 410 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวต้มทรงเครื่อง', 'ปริมาณแคลอรี่: 230 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวต้มปลา', 'ปริมาณแคลอรี่: 325 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดกระเพราหมูกรอบ', 'ปริมาณแคลอรี่: 650 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดกะเพรากุ้ง', 'ปริมาณแคลอรี่: 540 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดกะเพราไก่', 'ปริมาณแคลอรี่: 554 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดกะเพราหมู', 'ปริมาณแคลอรี่: 580 kcal', 'ความเผ็ด: ปานกลาง-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดกุ้งใส่ไข่', 'ปริมาณแคลอรี่: 595 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดกุนเชียง', 'ปริมาณแคลอรี่: 590 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดแกงเขียวหวานไก่', 'ปริมาณแคลอรี่: 630 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดคะน้าหมูกรอบ', 'ปริมาณแคลอรี่: 670 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดต้มยำทะเลแห้ง', 'ปริมาณแคลอรี่: 400 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดน้ำพริกกุ้งสด', 'ปริมาณแคลอรี่: 460 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดน้ำพริกเผาหมู', 'ปริมาณแคลอรี่: 665 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดน้ำพริกลงเรือ', 'ปริมาณแคลอรี่: 605 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดปลาเค็ม', 'ปริมาณแคลอรี่: 405 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดปลาหมึกน้ำพริกเผา', 'ปริมาณแคลอรี่: 535 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดปูใส่ไข่', 'ปริมาณแคลอรี่: 610 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดผักกระเฉดหมูกรอบ', 'ปริมาณแคลอรี่: 600 kcal', 'ความเผ็ด: น้อย', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดมันกุ้งใส่ไข่', 'ปริมาณแคลอรี่: 575 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดรวมมิตร', 'ปริมาณแคลอรี่: 210 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดสับปะรด', 'ปริมาณแคลอรี่: 335 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดไส้กรอก', 'ปริมาณแคลอรี่: 520 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดหมูน้ำพริกเผา', 'ปริมาณแคลอรี่: 665 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดหมูใส่ไข่', 'ปริมาณแคลอรี่: 557 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดแหนม', 'ปริมาณแคลอรี่: 610 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวผัดอเมริกัน', 'ปริมาณแคลอรี่: 790 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวพะแนงเนื้อ', 'ปริมาณแคลอรี่: 457 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวมันไก่', 'ปริมาณแคลอรี่: 596 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวมันไก่ทอด', 'ปริมาณแคลอรี่: 695 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวราดแกงเขียวหวานไก่', 'ปริมาณแคลอรี่: 483 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวราดผัดผักบุ้ง', 'ปริมาณแคลอรี่: 155 kcal', 'ความเผ็ด: น้อย', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวราดผัดผักใส่หมู', 'ปริมาณแคลอรี่: 370 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวราดหน้าไก่', 'ปริมาณแคลอรี่: 400 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหน้ากุ้งผัดพริดสด', 'ปริมาณแคลอรี่: 540 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหน้าเป็ด', 'ปริมาณแคลอรี่: 495 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหมกไก่', 'ปริมาณแคลอรี่: 534 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหมูแดง', 'ปริมาณแคลอรี่: 541 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหมูทอด', 'ปริมาณแคลอรี่: 416 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหมูทอดกระเทียม', 'ปริมาณแคลอรี่: 525 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ข้าวหมูอบ', 'ปริมาณแคลอรี่: 389 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่กรอบราดหน้า', 'ปริมาณแคลอรี่: 515 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่กรอบราดหน้าไก่หน่อไม้', 'ปริมาณแคลอรี่: 660 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่กรอบราดหน้ารวมมิตร', 'ปริมาณแคลอรี่: 690 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่กึ่งสำเร็จรูปผัดกระเพราหมู', 'ปริมาณแคลอรี่: 540 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่กึ่งสำเร็จรูปผัดขี้เมา', 'ปริมาณแคลอรี่: 530 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่เกี๊ยวเป็ดย่าง', 'ปริมาณแคลอรี่: 415 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่น่องไก่ไม่ระบุน้ำ', 'ปริมาณแคลอรี่: 375 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่น้ำเกี๊ยวหมูแดง', 'ปริมาณแคลอรี่: 305 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่น้ำต้มยำหมู', 'ปริมาณแคลอรี่: 300 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่น้ำน่องไก่', 'ปริมาณแคลอรี่: 375 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่น้ำเป็ด', 'ปริมาณแคลอรี่: 370 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่น้ำหมูต้มยำ', 'ปริมาณแคลอรี่: 300 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่หมูแดง', 'ปริมาณแคลอรี่: 231 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['บะหมี่แห้งหมูแดง', 'ปริมาณแคลอรี่: 345 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ราดหน้าบะหมี่กรอบ', 'ปริมาณแคลอรี่: 515 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ราดหน้าบะหมี่กรอบไก่', 'ปริมาณแคลอรี่: 660 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ราดหน้าปลากระพง', 'ปริมาณแคลอรี่: 435 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ราดหน้าเส้นใหญ่หมู', 'ปริมาณแคลอรี่: 405 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ราดหน้าหมูหมี่กรอบ', 'ปริมาณแคลอรี่: 690 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ผัดมักกะโรนีกุ้ง', 'ปริมาณแคลอรี่: 420 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ผัดมักกะโรนีหมู', 'ปริมาณแคลอรี่: 514 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['สุกี้กุ้ง', 'ปริมาณแคลอรี่: 330 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['สุกี้ไก่', 'ปริมาณแคลอรี่: 530 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['สุกี้น้ำไก่', 'ปริมาณแคลอรี่: 585 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['สุกี้หมู', 'ปริมาณแคลอรี่: 570 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['สุกี้แห้งทะเล', 'ปริมาณแคลอรี่: 580 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['เส้นก๋วยเตี๋ยวผัดขี้เมา', 'ปริมาณแคลอรี่: 605 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['เส้นหมี่ลูกชิ้นน้ำใส', 'ปริมาณแคลอรี่: 225 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยจั๊บ', 'ปริมาณแคลอรี่: 240 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยจั๊บญวณ', 'ปริมาณแคลอรี่: 235 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวแขก', 'ปริมาณแคลอรี่: 380 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวคั่วไก่', 'ปริมาณแคลอรี่: 435 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวต้มยำกุ้ง', 'ปริมาณแคลอรี่: 320 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเนื้อเรียง', 'ปริมาณแคลอรี่: 370 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเนื้อสับ', 'ปริมาณแคลอรี่: 370 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวผัดกะเพราไก่', 'ปริมาณแคลอรี่: 440 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวผัดไทยใส่ไข่', 'ปริมาณแคลอรี่: 577 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเรือน้ำตก', 'ปริมาณแคลอรี่: 180 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเรือน้ำตกแห้ง', 'ปริมาณแคลอรี่: 225 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นปลาน้ำ', 'ปริมาณแคลอรี่: 375 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นปลาแห้ง', 'ปริมาณแคลอรี่: 420 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นเล็กต้มยำหมู', 'ปริมาณแคลอรี่: 335 kcal', 'ความเผ็ด: น้อย-มาก', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นเล็กหมูแห้ง', 'ปริมาณแคลอรี่: 330 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นหมี่น้ำลูกชิ้นเนื้อวัว', 'ปริมาณแคลอรี่: 226 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นหมี่ลูกชิ้นเนื้อ', 'ปริมาณแคลอรี่: 258 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นใหญ่ผัดซีอิ๊วใส่ไข่', 'ปริมาณแคลอรี่: 520 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าไก่', 'ปริมาณแคลอรี่: 397 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี '],
      ['ก๋วยเตี๋ยวเส้นใหญ่ราดหน้าหมู', 'ปริมาณแคลอรี่: 397 kcal', 'ความเผ็ด: ไม่ระบุ', 'ราคา: ข้อมูลยังไม่มี ']
    ],
      res: [
        ['บาร์ใหม่','ประเภทร้าน: บาร์/โรงอาหาร','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ม.เกษตร'],
        ['บาร์ใหม่กว่า','ประเภทร้าน: บาร์/โรงอาหาร','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ม.เกษตร'],
        ['บาร์วิศวะ (IUP)','ประเภทร้าน: บาร์/โรงอาหาร','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ม.เกษตร'],
        ['บาร์บริหาร (BUS)','ประเภทร้าน: บาร์/โรงอาหาร','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ม.เกษตร'],
        ['บาร์วิทย์','ประเภทร้าน: บาร์/โรงอาหาร','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ม.เกษตร'],
        ['ร้านชมจันทร์','ประเภทร้าน: ร้านอาหารตามสั่ง','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตรงข้ามประตู 1 ม.เกษตร'],
        ['ร้านแซม','ประเภทร้าน: สเต็ก','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ก่อนถึงตลาดอมรภัณฑ์ ฝั่งประตูงาม 1 ม.เกษตร'],
        ['ร้านกอลิล่า','ประเภทร้าน: สเต็ก','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตลาดอมรภัณฑ์'],
        ['ร้านพี่กร ซอย54','ประเภทร้าน: ร้านอาหารตามสั่ง','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตรงข้ามประตูงาม 1 ม.เกษตร ซอย52'],
        ['ร้านสี่แยก ซอย52','ประเภทร้าน: ร้านอาหารตามสั่ง','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตรงข้ามประตูงาม 1 ม.เกษตร ซอย52'],
        ['ตลาดอมรภัณฑ์','ประเภทร้าน: ตลาด','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตลาดอมรภัณฑ์'],
        ['ร้านข้าวมันไก่ ซอย52','ประเภทร้าน: ร้านข้าวมันไก่','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตรงข้ามประตูงาม 1 ม.เกษตร ซอย52'],
        ['ร้านยอดมนุษย์','ประเภทร้าน: โจ๊ก/ก๋วยเตี๋ยว/ข้าวหมูแดง','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: โฮมวิลเลจ ม.เกษตร'],
        ['ร้านจ๊ะเอ๋','ประเภทร้าน: ร้านอาหารตามสั่ง','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ก่อนถึงตลาดอมรภัณฑ์ ฝั่งประตูงาม 1 ม.เกษตร'],
        ['ร้านก๋วยจั๊บญวน','ประเภทร้าน: ก๋วยจั๊บญวน','เวลาเปิด/ปิด: ข้อมูลยังไม่มี','ตำแหน่ง: ตรงข้ามประตูงาม 1 ม.เกษตร ซอย52']

      ],
      get_food: ['กดสุ่มเลยจ้า','','',''],
      checkRepeatedly: '',
      show: false,
      showShake: false,
      showClass: undefined,
      showShakeClass: undefined,
      toggleActive: false
      
    }
  }

  showFlipResult = (event) => {
    this._showFlipResult(event)
  }

  _showFlipResult(event) {
    this.setState({
      show: !this.state.show,
      showClass: (!this.state.show ? "animated flipInY": "animated flipInX")
    })
  }
  showShakeRandom = (event) => {
    this._showShakeRandom(event)
  }

  _showShakeRandom(event) {
    this.setState({
      showShake: !this.state.showShake,
      showShakeClass: (!this.state.showShake ? "btnShake": "btnShakeII")
    })
  }
  
  toggleActived = () => {
    this.setState({
      toggleActive: !this.state.toggleActive
    })
  }

  btnRandoming = () => {
    if(this.state.toggleActive){
      this.randomFood()
    }
    else{
      this.randomRes()
    }
    
    this.showShakeRandom()
    this.showFlipResult()
    
    
  }
  randomRes = () => {
    while(1){
      var index_random = Math.floor((Math.random() * this.state.res.length) + 1) - 1
      if(this.state.checkRepeatedly !== this.state.res[index_random][0]){
        this.setState({
          get_food: this.state.res[index_random],
          checkRepeatedly: this.state.res[index_random][0]
        })
        break
      }
    }
    
    
  }

  randomFood = () => {  
    while(1){
      var index_random = Math.floor((Math.random() * this.state.menu.length) + 1) - 1
      if(this.state.checkRepeatedly !== this.state.menu[index_random][0]){
      this.setState({
        get_food: this.state.menu[index_random],
        checkRepeatedly: this.state.menu[index_random][0]
      })
      break
      }
    }
  }
  
  render() {
    return (
      <div className="App-randfood">
        
        <br />
        <img src={Banner} style={styBanner} className="animated swing" />
        <br /><br />

        <Result get_food={this.state.get_food} flipResult={this.state.showClass} />
      
      <div style={spaceDiv}></div>

      <div className="container" >
      <div className="row">
      <div className="col-lg-2"></div>
      <div className="col-sm-1 col-md-3 col-lg-2"></div>
      <div className="col-xs-6 col-sm-5 col-md-3 col-lg-2"><Dialog get_food={this.state.get_food}/></div>
      <div className="col-xs-6 col-sm-5 col-md-3 col-lg-2"><div  onClick={this.toggleActived}><Toggle /></div></div>
      <div className="col-sm-1 col-md-3 col-lg-2" ></div>
      <div className="col-lg-2"></div>
      </div></div>
      
      <img src={Random} onClick = {this.btnRandoming} style={styRandom} className={this.state.showShakeClass} />
      <Footer />
      
      
        

       

        
      </div>
    );
  }
}

export default App;
