import React, { Component } from 'react';
import logo from '../logo.svg';
import Result from '../components/result_random'
import Detail from '../components/detail'



class App extends Component {
  constructor(props){
    super(props);
    this.state = {
      // getFood: ['กุ้ง','ไก่']
      menu: [
      'ข้าวผัด หมู ไก่ กุ้ง',
      'ข้าวไข่เจียว',
      'ข้าวหมูทอดกระเทียมพริกไทย',
      'กระเพราหมูกรอบ',
      'ข้าวกระเพราปลาหมึก',
      'ผัดผักราดข้าว',
      'กระเพราไข่เยี่ยวม้า',
      'ไข่เยี่ยวม้าหมูสับกระเพรากรอบ',
      'ผัดคะน้าปลาเค็ม',
      'ผัดคะน้าหมูกรอบ',
      'ผัดคะน้าน้ำมันหอย',
      'ถั่วฝักยาวผัดพริกแกงราดข้าว',
      'ผัดพริกสดราดข้าว',
      'สุกี้แห้ง ไก่ กุ้ง หมู ทะเล รวมมิตร',
      'สุกี้น้ำ  ไก่ กุ้ง หมู ทะเล รวมมิตร',
      'ราดหน้า หมู ไก่ กุ้ง ทะเล',
      'ผัดซีอิ๊ว',
      'ผัดผักบุ้งไฟแดง',
      'ปลากระพงนึงมะนาว',
      'ปลากระพงทอดราดน้ำปลา ',
      'ยำมาม่า',
      'กระเพราะหมูกรอบ',
      'ไก่ผัดเม็ดมะม่วงหิมพานต์',
      'ตับทอดกระเทียมพริกไทย',
      'ผัดดอกช่ายกับตับหมู',
      'ผัดไท',
      'ต้มยำรวมมิตรทะเลน้ำใส',
      'ผัดผักกาดขาวกับกุ้ง',
      'กระเพราะหมูสับไข่ดาว',
      'เต้าหู้ทรงเครื่อง',
      'ผัดเต้าหู้กับดอกกุ๋ยช่าย',
      'ผัดพริกแกงไก่',
      'ผัดวุ้นเส้น',
      'แกงจืดเต้าหู้หมูสับ',
      'หมูผัดหนำเลี้ยบ',
      'ปลาเก๋าสามรส',
      'ลาบปลาดุก',
      'ลาบหมู',
      'ลาบไก่',
      'ผัดผักกาดขาวกับกุ้ง',
      'ข้าวราดผัดฉ่าหมู ไก่',
      'ผัดเผ็ดหอยลาย',
      'ไข่เจียวกุ้งสับ',
      'ไข่เจียวหมูสับ',
      'ไก่ทอดกระเทียมพริกไทย',
      'แกงจืดวุ้นเส้น',
      'กระเพาะปลาผัดแห้ง',
      'ข้อไก่ทอด',
      'ปีกไก่ทอด',
      'ปลาหมึกชุบแป้งทอด ',
      'ยำสามกรอบ',
      'ต้มยำรวมมิตรทะเลน้ำข้น',
      'ต้มข่าไก่',
      'ยำวุ้นเส้น',
      'ปลาหมึกทอดกระเทียมพริกไทย',
      'กุ้งทอดกระเทียมพริกไทย',
      'ปลาหมึกผัดไข่เค็ม',
      'ยำถั่วพลู',
      'หมูทอดกระเทียมพริกไทย',
      'ปลาทอดกระเทียมพริกไทย',
      'ข้าวหมูทอดกระเทียม',
      'ข้าวผัดไก่  กุ้ง หมู',
      'ผัดกระเพราเนื้อ',
      'ผัดกระเพราหมู',
      'ผัดกระเพราปลาหมึก',
      'ข้าวผัดปลากระป๋อง',
      'ยำปลากระป๋อง',
      'ข้าวผัดกุนเชียง',
      'ไข่ผัดแหนม',
      'ข้าวผัดแหนม',
      'แกงจืดเต้าหู้หมูสับ',
      'ผัดผักรวม',
      'ทอดมันปลากราย',
      'หมูยอทอด',
      'ยำหมูยอ',
      'ยำกุนเชียง',
      'ยำหมูแผ่น',
      'ยำไข่ดาว',
      'ยำรวมมิตร',
      'ไส้ตันทอดกระเทียม',
      'ยำปลาดุกฟูข้าวผัดผงกระหรี่กุ้ง',
      'มาม่าผัดขี้เมาทะเล',
      'ผัดเขียวแห้งไก่ราดข้าว',
      'ข้าวไก่ทอดกระเทียม',
      'ข้าวมันไก่',
      'ข้าวพริกแกงหมูกรอบ',
      'มาม่าผัดต้มยำ',
      'ข้าวหมูทอดกระเทียม',
      'ข้าวกะเพราหมูสับ',
      'ข้าวกะเพราไก่',
      'ข้าวผัดหมู',
      'ข้าวคะน้าหมูกรอบ',
      'ข้าวผัดปลาเค็ม',
      'ข้าวไข่เจียว',
      'ข้าวผัดกุ้ง',
      'ข้าวผัดทะเล'],
      get_food: 'กดสุ่มเลยจ้า'
    }
  }
  RandomFood = () => {
    
    var index_random = Math.floor((Math.random() * this.state.menu.length) + 1) - 1
    this.setState({
      get_food: this.state.menu[index_random]
    })
  }
  render() {
    return (
      <div className="App-randfood">
        <p>Kin Rai D @KU</p>
        <Result get_food = {this.state.get_food} />
        <br />
        <Detail get_food = {this.state.get_food} />
        <br />
        <button onClick = {this.RandomFood}> สุ่มค้าบ </button>
        
      </div>
    );
  }
}

export default App;
